main/InformationRegisters/ВерсииПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВерсииПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/CommonModules/ОбновлениеИнформационнойБазыСлужебный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВерсияИБ(ИдентификаторБиблиотеки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииПодсистем.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
	|ГДЕ
	|	ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы";
	
	Запрос.УстановитьПараметр("ИмяПодсистемы", ИдентификаторБиблиотеки);
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Результат = "";
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Результат = СокрЛП(ТаблицаЗначений[0].Версия);
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(Результат), "0.0.0", Результат);
	
КонецФункции

Функция ПолучитьИдентификаторТекущейБазы() Экспорт
	
	Возврат "ДетскиеПрививки";
	
КонецФункции

Процедура УстановитьНовуюВерсиюИнформационнойБазы() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПодсистемы = ПолучитьИдентификаторТекущейБазы();
	МенеджерЗаписи.Версия = Метаданные.Версия;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
